2026.05.26.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2026.05.19.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2026.06.02.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of May 19 to 26, 2026.

#+TOC: headlines 1


* Dune 3.23
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-23/18055/5

** Continuing this thread, Shon announced


The Dune team is pleased to announce [[https://github.com/ocaml/dune/releases/tag/3.23.1][the release of dune 3.23.1]].

This is a patch release consisting of the following bug fixes.

If you encounter a problem with this release, please report it in [[https://github.com/ocaml/dune/issues][our issue
tracker]].

*** Fixed

- Fix the ~menhir~ opam dependency injection introduced in 3.23. Dune    now only fills in the lower bound ~{>= "20180523"}~ on an existing   user-declared ~menhir~ dependency; it no longer adds ~menhir~ as a new dependency to packages that did not declare it themselves.    (#14434, fixes #14428, @robinbb)
- Gate the ~dune~ version-bound deduplication in generated opam files    (introduced in 3.23) on ~(lang dune 3.23)~. Projects at earlier lang    versions get the prior ~And [...]~ shape — e.g.
  ~{>= "3.17" & >= "3.20"}~ — restoring 3.22 behaviour and avoiding a    silent change to opam output on dune-binary upgrade. (#14436, @robinbb)
- Preserve library order when building a shared jsoo standalone runtime.    (#14438, @vouillon)
- Fix the fallback to the secondary compiler, allowing recovering of support for    packages with upper bounds on OCaml less than 4.14. Packages depending on dune    3.23.1 or later and with an upper bound on the OCaml compiler that is less    than 4.14, will now be able to use the latest dune, but dune will be built    with the secondary compiler at version 4.14. (#14443, @Alizter)
- Fix the bootstrap on NetBSD by including ~<sys/wait.h>~ in ~lev_stubs.c~,   matching the existing FreeBSD/OpenBSD guard.    (#14512, fixes #14484, @0-wiz-0)
      



* Call for Presentations: ML Family Workshop 2026
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/call-for-presentations-ml-family-workshop-2026/18155/1

** Benoît Montagu announced


*Higher-order, Typed, Inferred, Strict: ML Family Workshop 2026*

*August 28, 2026*

*Indianapolis (Co-located with [[https://icfp26.sigplan.org/][ICFP]]) + Paris (Co-located with [[https://www.irif.fr/~scherer/events/fpw-2026/announce.html][FW'26]])*

*Website:* https://icfp26.sigplan.org/home/mlfamilyworkshop-2026

*Submission Link:* https://ml2026.hotcrp.com/

*Submission Deadline:* June 24, 2026, AoE

*** Call for Presentations

ML (originally, "Meta Language") is a family of programming languages 
that includes dialects known as Standard ML, OCaml, and F#, among 
others. The development of these languages has inspired a large amount 
of computer science research, both practical and theoretical.

The ML 2026 workshop will continue the informal approach followed 
since 2010. Presentations are selected by the program committee from 
submitted proposals. There are no published proceedings, so 
contributions may be submitted for publication elsewhere. The main 
criterion is promoting and informing the development of the entire 
extended ML family and delivering a lively workshop atmosphere. We 
particularly encourage talks about works in progress, presentations of 
negative results (things that were expected to but did not quite work 
out) and informed positions.

Each presentation should take 20-25 minutes. The exact time will be 
decided based on scheduling constraints.

*Note*: this year, the workshop will take place across two events: (1) co-located
with [[https://icfp26.sigplan.org/][ICFP’26]], and (2) co-located with [[https://www.irif.fr/~scherer/events/fpw-2026/announce.html][FW’26]]. We will have a single Program
Committee to review submissions. Presenters can choose either event to
attend in-person. We also encourage remote participation, and plan to
facilitate remote presentations.

*** Scope

We seek presentations on topics including (but not limited to):

- Language design: abstraction, higher forms of polymorphism, concurrency and parallelism, distribution and mobility, staging, extensions for semi-structured data, generic programming, object systems, etc.

- Implementation: compilers, interpreters, type checkers, partial evaluators, runtime systems, garbage collectors, foreign function interfaces, etc.

- Type systems: inference, effects, modules, contracts, specifications and assertions, dynamic typing, error reporting, etc.

- Applications: case studies, experience reports, pearls, etc.

- Environments: libraries, tools, editors, debuggers, cross-language interoperability, functional data structures, etc.

- Semantics of ML-family languages: operational and denotational semantics, program equivalence, parametricity, mechanization, etc.

We specifically encourage reporting what did not meet expectations or 
what, despite all efforts, did not work to satisfaction.

Four kinds of submissions are solicited: Research Presentations, 
Experience Reports, Demos, and Informed Positions.

- Research Presentations: Research presentations should describe new ideas, experimental results, or significant advances in ML-related projects. We especially encourage presentations that describe work in progress, that outline a future research agenda, or that encourage lively discussion. These presentations should be structured in a way which can be, at least in part, of interest to (advanced) users.

- Experience Reports: Users are invited to submit Experience Reports about their use of ML and related languages. These presentations do not need to contain original research but they should tell an interesting story to researchers or other advanced users, such as an innovative or unexpected use of advanced features or a description of the challenges they are facing or attempting to solve.

- Demos: Live demonstrations or short tutorials should show new developments, interesting prototypes, or work in progress, in the form of tools, libraries, or applications built on or related to ML and related languages. (You will need to provide all the hardware and software required for your demo; the workshop organizers are only able to provide a projector.)

- Informed Positions: A justified argument for or against a language feature. The argument must be substantiated, either theoretically (e.g., by a demonstration of (un)soundness, an inference algorithm, a complexity analysis), empirically or by substantial experience. Personal experience is accepted as justification so long as it is extensive and illustrated with concrete examples.

*** Submission details

Submissions must be in the PDF format and have a short summary 
(abstract) at the beginning. Submissions in the categories of 
Experience Reports, Demos, or Informed Positions should indicate so in 
the title or subtitle. The point of the submission should be clear 
from its two first pages (PC members are not obligated to read any 
further.)

Submissions must be uploaded to the workshop submission website before 
the submission deadline.

Only the short summary/abstract of accepted submissions will be 
published on the conference website. After acceptance, authors will 
have the opportunity to attach or link to that summary any relevant 
material (such as the updated submission, slides, etc.)

*Submission Website*: https://ml2026.hotcrp.com/

*Workshop Website*: https://icfp26.sigplan.org/home/mlfamilyworkshop-2026

*** Dates and Deadlines

*Submission Deadline*: Wednesday, June 24 AoE

*Initial Author Notification* (most cases): Thursday, July 23

*Final Author Notification* (if needed): Thursday, July 30

*Workshop Date*: Friday, August 28

*** Program Committee

- Benoît Montagu (Inria, France)
- Gabriel Scherer (Inria, France)
- Sam Westrick (New York University, United States)
- Clément Blaudeau (Inria, France)
- Richard A. Eisenberg (Jane Street, United States)
- Kavon Farvardin (Apple, United States)
- Kiran Gopinathan (Basis, United States)
- Magnus Madsen (Aarhus University, Denmark)
- Alexandre Moine (New York University, United States)
- Dominic Orchard (University of Cambridge; University of Kent, United Kingdom)
- Lionel Parreaux (HKUST (The Hong Kong University of Science and Technology), Hong Kong SAR China)
- Gabriel Radanne (Inria, France)
- Takafumi Saikawa (Nagoya University, Japan)
- Milla Valnet (Sorbonne Université, France)
- Michael Vollmer (University of Kent, United Kingdom)
- Ningning Xie (University of Toronto, Canada)
- Yizhou Zhang (University of Waterloo, Canada)

*** Past Iterations

2025: https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025

2024: https://icfp24.sigplan.org/home/mlworkshop-2024

2023: https://icfp23.sigplan.org/home/mlworkshop-2023

2022: https://icfp22.sigplan.org/home/mlfamilyworkshop-2022

2021: https://icfp21.sigplan.org/home/mlfamilyworkshop-2021

More info: https://www.mlworkshop.org/home

*** Coordination with the OCaml Users and Developers Workshop

The OCaml workshop is seen as more practical and is dedicated in 
significant part to OCaml community building and the development of 
the OCaml system. In contrast, the ML family workshop is not focused 
on any language in particular, is more research-oriented, and deals 
with general issues of ML-style programming and type systems. There 
is some overlap, which we are keen to explore in various ways. The 
authors who feel their submission fits both workshops are encouraged 
to mention it at submission time or contact the program chairs.
      



* ocaml-halo 0.1 -- Performance oriented HTTP 1.1 server built on top of libuv
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-halo-0-1-performance-oriented-http-1-1-server-built-on-top-of-libuv/18161/1

** Firgeis announced


Hi community, I'm happy to announce the first "alpha" release of [[https://github.com/Firgeis/ocaml-halo][ocaml-halo]], a performance oriented Ocaml HTTP 1.1 server.

The main idea behind this server is keep the performance sensitive parts of an HTTP in C, leveraging Effects to ease the transition between the boundary of FFI and ocaml resolvers.

*** Features

- Full HTTP 1.1 spec 
- SSL/TLS enabled
- Streaming
- Performance, currently on par with with Go frameworks like gin-gonic
      



* dead_code_analyzer 1.1.1 and 1.2.0
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-1-1-and-1-2-0/18164/1

** fantazio announced


Hello everyone,

I am happy to announce [[https://github.com/LexiFi/dead_code_analyzer/releases][2 releases of the dead_code_analyzer]] (available via ~opam~) :

- Release [[https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.1.1][1.1.1]] includes a number of bug fixes and strengthens semantics. It also improves the [[https://github.com/LexiFi/dead_code_analyzer/blob/1.1.1/docs/USER_DOC.md][user documentation]] by describing each report section, their usage and limitations with examples. This release is compatible with **OCaml 5.2**.

- Release [[https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.2.0][1.2.0]] is an update of 1.1.1, compatible with **OCaml 5.3**. The analyzer now takes ~.cmti~ and ~.cmt~ files as input instead of ~.cmi~ and ~.cmt~. You may notice a larger memory consumption (more information available [[https://github.com/LexiFi/dead_code_analyzer/pull/38][here]]).

I addition to these releases, a version compatible with **OCaml 4.14** is [[https://github.com/fantazio/dead_code_analyzer/tree/4.14][available on my fork]].

Thanks to the [[https://ocaml-sf.org/][OCaml Software Foundation]] its funding!

If you encounter any issue with these releases, please [[https://github.com/LexiFi/dead_code_analyzer/issues][report it on the github repository]].
Feedback and contributions are welcome.
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
