2026.05.26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-26 Tue 09:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2026.05.19.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2026.06.02.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of May 19 to 26, 2026.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Dune 3.23</a></li>
<li><a href="#2">Call for Presentations: ML Family Workshop 2026</a></li>
<li><a href="#3">ocaml-halo 0.1 &ndash; Performance oriented HTTP 1.1 server built on top of libuv</a></li>
<li><a href="#4">dead_code_analyzer 1.1.1 and 1.2.0</a></li>
<li><a href="#org8bd8361">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Dune 3.23</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-23/18055/5">https://discuss.ocaml.org/t/ann-dune-3-23/18055/5</a>
</p>
</div>
<div id="outline-container-orgf956b12" class="outline-3">
<h3 id="orgf956b12">Continuing this thread, Shon announced</h3>
<div class="outline-text-3" id="text-orgf956b12">
<p>
The Dune team is pleased to announce <a href="https://github.com/ocaml/dune/releases/tag/3.23.1">the release of dune 3.23.1</a>.
</p>

<p>
This is a patch release consisting of the following bug fixes.
</p>

<p>
If you encounter a problem with this release, please report it in <a href="https://github.com/ocaml/dune/issues">our issue
tracker</a>.
</p>
</div>
<div id="outline-container-org6063baa" class="outline-4">
<h4 id="org6063baa">Fixed</h4>
<div class="outline-text-4" id="text-org6063baa">
<ul class="org-ul">
<li>Fix the <code>menhir</code> opam dependency injection introduced in 3.23. Dune    now only fills in the lower bound <code>{&gt;= "20180523"}</code> on an existing   user-declared <code>menhir</code> dependency; it no longer adds <code>menhir</code> as a new dependency to packages that did not declare it themselves.    (#14434, fixes #14428, @robinbb)</li>
<li>Gate the <code>dune</code> version-bound deduplication in generated opam files    (introduced in 3.23) on <code>(lang dune 3.23)</code>. Projects at earlier lang    versions get the prior <code>And [...]</code> shape — e.g.
<code>{&gt;= "3.17" &amp; &gt;= "3.20"}</code> — restoring 3.22 behaviour and avoiding a    silent change to opam output on dune-binary upgrade. (#14436, @robinbb)</li>
<li>Preserve library order when building a shared jsoo standalone runtime.    (#14438, @vouillon)</li>
<li>Fix the fallback to the secondary compiler, allowing recovering of support for    packages with upper bounds on OCaml less than 4.14. Packages depending on dune    3.23.1 or later and with an upper bound on the OCaml compiler that is less    than 4.14, will now be able to use the latest dune, but dune will be built    with the secondary compiler at version 4.14. (#14443, @Alizter)</li>
<li>Fix the bootstrap on NetBSD by including <code>&lt;sys/wait.h&gt;</code> in <code>lev_stubs.c</code>,   matching the existing FreeBSD/OpenBSD guard.    (#14512, fixes #14484, @0-wiz-0)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Call for Presentations: ML Family Workshop 2026</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/call-for-presentations-ml-family-workshop-2026/18155/1">https://discuss.ocaml.org/t/call-for-presentations-ml-family-workshop-2026/18155/1</a>
</p>
</div>
<div id="outline-container-org0ebd022" class="outline-3">
<h3 id="org0ebd022">Benoît Montagu announced</h3>
<div class="outline-text-3" id="text-org0ebd022">
<p>
<b>Higher-order, Typed, Inferred, Strict: ML Family Workshop 2026</b>
</p>

<p>
<b>August 28, 2026</b>
</p>

<p>
<b>Indianapolis (Co-located with <a href="https://icfp26.sigplan.org/">ICFP</a>) + Paris (Co-located with <a href="https://www.irif.fr/~scherer/events/fpw-2026/announce.html">FW'26</a>)</b>
</p>

<p>
<b>Website:</b> <a href="https://icfp26.sigplan.org/home/mlfamilyworkshop-2026">https://icfp26.sigplan.org/home/mlfamilyworkshop-2026</a>
</p>

<p>
<b>Submission Link:</b> <a href="https://ml2026.hotcrp.com/">https://ml2026.hotcrp.com/</a>
</p>

<p>
<b>Submission Deadline:</b> June 24, 2026, AoE
</p>
</div>
<div id="outline-container-org115a2f8" class="outline-4">
<h4 id="org115a2f8">Call for Presentations</h4>
<div class="outline-text-4" id="text-org115a2f8">
<p>
ML (originally, "Meta Language") is a family of programming languages 
that includes dialects known as Standard ML, OCaml, and F#, among 
others. The development of these languages has inspired a large amount 
of computer science research, both practical and theoretical.
</p>

<p>
The ML 2026 workshop will continue the informal approach followed 
since 2010. Presentations are selected by the program committee from 
submitted proposals. There are no published proceedings, so 
contributions may be submitted for publication elsewhere. The main 
criterion is promoting and informing the development of the entire 
extended ML family and delivering a lively workshop atmosphere. We 
particularly encourage talks about works in progress, presentations of 
negative results (things that were expected to but did not quite work 
out) and informed positions.
</p>

<p>
Each presentation should take 20-25 minutes. The exact time will be 
decided based on scheduling constraints.
</p>

<p>
<b>Note</b>: this year, the workshop will take place across two events: (1) co-located
with <a href="https://icfp26.sigplan.org/">ICFP’26</a>, and (2) co-located with <a href="https://www.irif.fr/~scherer/events/fpw-2026/announce.html">FW’26</a>. We will have a single Program
Committee to review submissions. Presenters can choose either event to
attend in-person. We also encourage remote participation, and plan to
facilitate remote presentations.
</p>
</div>
</div>
<div id="outline-container-orge21b05b" class="outline-4">
<h4 id="orge21b05b">Scope</h4>
<div class="outline-text-4" id="text-orge21b05b">
<p>
We seek presentations on topics including (but not limited to):
</p>

<ul class="org-ul">
<li>Language design: abstraction, higher forms of polymorphism, concurrency and parallelism, distribution and mobility, staging, extensions for semi-structured data, generic programming, object systems, etc.</li>

<li>Implementation: compilers, interpreters, type checkers, partial evaluators, runtime systems, garbage collectors, foreign function interfaces, etc.</li>

<li>Type systems: inference, effects, modules, contracts, specifications and assertions, dynamic typing, error reporting, etc.</li>

<li>Applications: case studies, experience reports, pearls, etc.</li>

<li>Environments: libraries, tools, editors, debuggers, cross-language interoperability, functional data structures, etc.</li>

<li>Semantics of ML-family languages: operational and denotational semantics, program equivalence, parametricity, mechanization, etc.</li>
</ul>

<p>
We specifically encourage reporting what did not meet expectations or 
what, despite all efforts, did not work to satisfaction.
</p>

<p>
Four kinds of submissions are solicited: Research Presentations, 
Experience Reports, Demos, and Informed Positions.
</p>

<ul class="org-ul">
<li>Research Presentations: Research presentations should describe new ideas, experimental results, or significant advances in ML-related projects. We especially encourage presentations that describe work in progress, that outline a future research agenda, or that encourage lively discussion. These presentations should be structured in a way which can be, at least in part, of interest to (advanced) users.</li>

<li>Experience Reports: Users are invited to submit Experience Reports about their use of ML and related languages. These presentations do not need to contain original research but they should tell an interesting story to researchers or other advanced users, such as an innovative or unexpected use of advanced features or a description of the challenges they are facing or attempting to solve.</li>

<li>Demos: Live demonstrations or short tutorials should show new developments, interesting prototypes, or work in progress, in the form of tools, libraries, or applications built on or related to ML and related languages. (You will need to provide all the hardware and software required for your demo; the workshop organizers are only able to provide a projector.)</li>

<li>Informed Positions: A justified argument for or against a language feature. The argument must be substantiated, either theoretically (e.g., by a demonstration of (un)soundness, an inference algorithm, a complexity analysis), empirically or by substantial experience. Personal experience is accepted as justification so long as it is extensive and illustrated with concrete examples.</li>
</ul>
</div>
</div>
<div id="outline-container-org151a610" class="outline-4">
<h4 id="org151a610">Submission details</h4>
<div class="outline-text-4" id="text-org151a610">
<p>
Submissions must be in the PDF format and have a short summary 
(abstract) at the beginning. Submissions in the categories of 
Experience Reports, Demos, or Informed Positions should indicate so in 
the title or subtitle. The point of the submission should be clear 
from its two first pages (PC members are not obligated to read any 
further.)
</p>

<p>
Submissions must be uploaded to the workshop submission website before 
the submission deadline.
</p>

<p>
Only the short summary/abstract of accepted submissions will be 
published on the conference website. After acceptance, authors will 
have the opportunity to attach or link to that summary any relevant 
material (such as the updated submission, slides, etc.)
</p>

<p>
<b>Submission Website</b>: <a href="https://ml2026.hotcrp.com/">https://ml2026.hotcrp.com/</a>
</p>

<p>
<b>Workshop Website</b>: <a href="https://icfp26.sigplan.org/home/mlfamilyworkshop-2026">https://icfp26.sigplan.org/home/mlfamilyworkshop-2026</a>
</p>
</div>
</div>
<div id="outline-container-org8b976c2" class="outline-4">
<h4 id="org8b976c2">Dates and Deadlines</h4>
<div class="outline-text-4" id="text-org8b976c2">
<p>
<b>Submission Deadline</b>: Wednesday, June 24 AoE
</p>

<p>
<b>Initial Author Notification</b> (most cases): Thursday, July 23
</p>

<p>
<b>Final Author Notification</b> (if needed): Thursday, July 30
</p>

<p>
<b>Workshop Date</b>: Friday, August 28
</p>
</div>
</div>
<div id="outline-container-org0b8e29a" class="outline-4">
<h4 id="org0b8e29a">Program Committee</h4>
<div class="outline-text-4" id="text-org0b8e29a">
<ul class="org-ul">
<li>Benoît Montagu (Inria, France)</li>
<li>Gabriel Scherer (Inria, France)</li>
<li>Sam Westrick (New York University, United States)</li>
<li>Clément Blaudeau (Inria, France)</li>
<li>Richard A. Eisenberg (Jane Street, United States)</li>
<li>Kavon Farvardin (Apple, United States)</li>
<li>Kiran Gopinathan (Basis, United States)</li>
<li>Magnus Madsen (Aarhus University, Denmark)</li>
<li>Alexandre Moine (New York University, United States)</li>
<li>Dominic Orchard (University of Cambridge; University of Kent, United Kingdom)</li>
<li>Lionel Parreaux (HKUST (The Hong Kong University of Science and Technology), Hong Kong SAR China)</li>
<li>Gabriel Radanne (Inria, France)</li>
<li>Takafumi Saikawa (Nagoya University, Japan)</li>
<li>Milla Valnet (Sorbonne Université, France)</li>
<li>Michael Vollmer (University of Kent, United Kingdom)</li>
<li>Ningning Xie (University of Toronto, Canada)</li>
<li>Yizhou Zhang (University of Waterloo, Canada)</li>
</ul>
</div>
</div>
<div id="outline-container-org092212d" class="outline-4">
<h4 id="org092212d">Past Iterations</h4>
<div class="outline-text-4" id="text-org092212d">
<p>
2025: <a href="https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025">https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025</a>
</p>

<p>
2024: <a href="https://icfp24.sigplan.org/home/mlworkshop-2024">https://icfp24.sigplan.org/home/mlworkshop-2024</a>
</p>

<p>
2023: <a href="https://icfp23.sigplan.org/home/mlworkshop-2023">https://icfp23.sigplan.org/home/mlworkshop-2023</a>
</p>

<p>
2022: <a href="https://icfp22.sigplan.org/home/mlfamilyworkshop-2022">https://icfp22.sigplan.org/home/mlfamilyworkshop-2022</a>
</p>

<p>
2021: <a href="https://icfp21.sigplan.org/home/mlfamilyworkshop-2021">https://icfp21.sigplan.org/home/mlfamilyworkshop-2021</a>
</p>

<p>
More info: <a href="https://www.mlworkshop.org/home">https://www.mlworkshop.org/home</a>
</p>
</div>
</div>
<div id="outline-container-orgd437003" class="outline-4">
<h4 id="orgd437003">Coordination with the OCaml Users and Developers Workshop</h4>
<div class="outline-text-4" id="text-orgd437003">
<p>
The OCaml workshop is seen as more practical and is dedicated in 
significant part to OCaml community building and the development of 
the OCaml system. In contrast, the ML family workshop is not focused 
on any language in particular, is more research-oriented, and deals 
with general issues of ML-style programming and type systems. There 
is some overlap, which we are keen to explore in various ways. The 
authors who feel their submission fits both workshops are encouraged 
to mention it at submission time or contact the program chairs.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">ocaml-halo 0.1 &ndash; Performance oriented HTTP 1.1 server built on top of libuv</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-halo-0-1-performance-oriented-http-1-1-server-built-on-top-of-libuv/18161/1">https://discuss.ocaml.org/t/ann-ocaml-halo-0-1-performance-oriented-http-1-1-server-built-on-top-of-libuv/18161/1</a>
</p>
</div>
<div id="outline-container-org599286b" class="outline-3">
<h3 id="org599286b">Firgeis announced</h3>
<div class="outline-text-3" id="text-org599286b">
<p>
Hi community, I'm happy to announce the first "alpha" release of <a href="https://github.com/Firgeis/ocaml-halo">ocaml-halo</a>, a performance oriented Ocaml HTTP 1.1 server.
</p>

<p>
The main idea behind this server is keep the performance sensitive parts of an HTTP in C, leveraging Effects to ease the transition between the boundary of FFI and ocaml resolvers.
</p>
</div>
<div id="outline-container-orge810a25" class="outline-4">
<h4 id="orge810a25">Features</h4>
<div class="outline-text-4" id="text-orge810a25">
<ul class="org-ul">
<li>Full HTTP 1.1 spec</li>
<li>SSL/TLS enabled</li>
<li>Streaming</li>
<li>Performance, currently on par with with Go frameworks like gin-gonic</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">dead_code_analyzer 1.1.1 and 1.2.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-1-1-and-1-2-0/18164/1">https://discuss.ocaml.org/t/ann-dead-code-analyzer-1-1-1-and-1-2-0/18164/1</a>
</p>
</div>
<div id="outline-container-org263665b" class="outline-3">
<h3 id="org263665b">fantazio announced</h3>
<div class="outline-text-3" id="text-org263665b">
<p>
Hello everyone,
</p>

<p>
I am happy to announce <a href="https://github.com/LexiFi/dead_code_analyzer/releases">2 releases of the dead_code_analyzer</a> (available via <code>opam</code>) :
</p>

<ul class="org-ul">
<li>Release <a href="https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.1.1">1.1.1</a> includes a number of bug fixes and strengthens semantics. It also improves the <a href="https://github.com/LexiFi/dead_code_analyzer/blob/1.1.1/docs/USER_DOC.md">user documentation</a> by describing each report section, their usage and limitations with examples. This release is compatible with <b><b>OCaml 5.2</b></b>.</li>

<li>Release <a href="https://github.com/LexiFi/dead_code_analyzer/releases/tag/1.2.0">1.2.0</a> is an update of 1.1.1, compatible with <b><b>OCaml 5.3</b></b>. The analyzer now takes <code>.cmti</code> and <code>.cmt</code> files as input instead of <code>.cmi</code> and <code>.cmt</code>. You may notice a larger memory consumption (more information available <a href="https://github.com/LexiFi/dead_code_analyzer/pull/38">here</a>).</li>
</ul>

<p>
I addition to these releases, a version compatible with <b><b>OCaml 4.14</b></b> is <a href="https://github.com/fantazio/dead_code_analyzer/tree/4.14">available on my fork</a>.
</p>

<p>
Thanks to the <a href="https://ocaml-sf.org/">OCaml Software Foundation</a> its funding!
</p>

<p>
If you encounter any issue with these releases, please <a href="https://github.com/LexiFi/dead_code_analyzer/issues">report it on the github repository</a>.
Feedback and contributions are welcome.
</p>
</div>
</div>
</div>
<div id="outline-container-org8bd8361" class="outline-2">
<h2 id="org8bd8361">Old CWN</h2>
<div class="outline-text-2" id="text-org8bd8361">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgfeff88a">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
